local HttpService = game:GetService("HttpService")
local TeleportService = game:GetService("TeleportService")
local Players = game:GetService("Players")
local CONFIG = {
    UserSaltMarker = "RHVtYkFzc05pZ2dlcl9g+",
    HiddenSalt = [[1467:<32;895|OPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NZPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NZPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NZPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NZPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NZPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NZPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½N]],
    MasterKey = [[1467:<32;895|OPĂ¯Â¿Â½NZPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NQPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NZPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NQPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NQPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NZPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NQPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½N[PĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NZPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NZPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NQPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½N^PĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NQPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NQPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½N[PĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NQPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NQPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½N^PĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NQPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NQPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½N_PĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NZPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NQPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NQPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NQPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NQPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NZPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NZPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NRPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½N[PĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NZPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NQPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NNPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NQPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NQPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NZPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NPPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NZPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NOPĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½NĂ¯Â¿Â½OĂ¯Â¿Â½N]],
    Prefix = "ALESCIAL-"
}
local function Decrypt(fullString)
    if fullString:sub(1, #CONFIG.Prefix) == CONFIG.Prefix then
        fullString = fullString:sub(#CONFIG.Prefix + 1)
    end
    if fullString:sub(1, #CONFIG.UserSaltMarker) == CONFIG.UserSaltMarker then
        fullString = fullString:sub(#CONFIG.UserSaltMarker + 1)
    else
        return nil, "Wrong Marker"
    end
    local randomHex = fullString:sub(1, 4)
    local bodyHex = fullString:sub(5)
    
    if #bodyHex == 0 then return nil, "Empty Body" end
    local dynamicKey = CONFIG.MasterKey .. CONFIG.HiddenSalt .. randomHex
    
    local keyBytes = { string.byte(dynamicKey, 1, #dynamicKey) }
    local keyLen = #keyBytes
    
    local result = {}
    local step = 0
    
    for i = 1, #bodyHex, 2 do
        local hexPair = bodyHex:sub(i, i+1)
        local byteCode = tonumber(hexPair, 16)
        
        if byteCode then
            local keyByte = keyBytes[(step % keyLen) + 1]
            local decodedByte = bit32.bxor(byteCode, keyByte)
            table.insert(result, string.char(decodedByte))
            step = step + 1
        end
    end
    
    return table.concat(result)
end
HopApi = function(url)
    if not url then return warn("Vui lòng nhập Link API!") end
    
    print("[ALESCIAL] Đang lấy JobID từ API...")
    
    local success, response = pcall(function()
        return game:HttpGet(url)
    end)
    
    if success then
        local data = HttpService:JSONDecode(response)
        
        if data.JobId and #data.JobId > 0 then
            local randomEntry = data.JobId[math.random(1, #data.JobId)]
            local encodedString, _ = next(randomEntry)
            
            if encodedString then
                print("[ALESCIAL] Đang giải mã...")
                local realJobId = Decrypt(encodedString)
                
                if realJobId then
                    print("[ALESCIAL] Tìm thấy JobID: " .. realJobId)
                    print("[ALESCIAL] Đang Teleport...")
                    
                    TeleportService:TeleportToPlaceInstance(game.PlaceId, realJobId, Players.LocalPlayer)
                else
                    warn("[ALESCIAL] Giải mã thất bại! Key không khớp.")
                end
            end
        else
            warn("[ALESCIAL] Không tìm thấy server nào trong API.")
        end
    else
        warn("[ALESCIAL] Lỗi kết nối API: " .. tostring(response))
    end
end
HopApi("http://gold05.vpsbumboo.com:25792/Api/indra")